app/controllers/posts_controller.rb

   def create

       @post = Post.new(post_params)
       @post.user_id = current_user.id #assinging posts to the users who created it
       respond_to do |f|
           if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test post with form box"], ["user_id", 2], ["created_at", "2017-03-15 10:08:31.428863"], ["updated_at", "2017-03-15 10:08:31.428863"]]